[
    {
        "name": "Acorns",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/acorns.jpg",
        "desc": "Acorns are the nuts produced by oak trees, which are native to various regions around the world. These small nuts (1-2 centimeters in length) are not commonly used as food for humans but they are used in some indigenous cultures after being processed to remove bitter tannins. Acorns can be ground into flour and used in baking or cooked to make a variety of traditional recipes."
    },
    {
        "name": "Andean Walnuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/andean-walnuts.jpg",
        "desc": "Andean walnuts are a variety of walnuts that are native to the Andean regions of South America, particularly Peru and Ecuador. They are sometimes referred to as Peruvian walnuts or Ecuadorian walnuts, depending on their specific origin. Andean walnuts are generally smaller in size than other walnut varieties, averaging around 2.5cm (1 inch) in length.Andean walnuts have a rich, buttery flavor with a slightly sweet and earthy undertone. They are known for their smooth and mellow taste making them perfect for a variety of culinary preparations. They can be eaten as a snack, added to baked goods, or incorporated into savory dishes, such as salads or pasta dishes."
    },
    {
        "name": "Baru Nuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/baru-nuts.jpg",
        "desc": "Baru nuts are native to the cerrado savanna region of Brazil, particularly in the states of Goiás, Tocantins, and Minas Gerais. Baru nuts are similar in size to almonds, measuring around 2 centimeters in length.Baru nuts have a unique flavor profile, often described as a combination of peanuts and almonds. They can be eaten raw or roasted and are used in a variety of dishes, such as snacks, nut butters, or to produce baru flour, which can be used in baking."
    },
    {
        "name": "Betel Nuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/betel-nuts.jpg",
        "desc": "Betel nuts, also known as areca nuts, come from the areca palm tree (Areca catechu), which is native to Southeast Asia. Betel nuts are usually small to medium-sized, similar in shape to almonds, and are enclosed within a hard shell. They have a mild, slightly bitter taste with a nutty aroma.Betel nuts are commonly chewed in many parts of Asia for their stimulating and refreshing effects. They are also used in traditional medicine, as an ingredient in various dishes, and in the preparation of betel quid. This is a mixture of betel nuts, betel leaves, and other ingredients that is chewed as a mouth freshener or for cultural and ceremonial purposes."
    },
    {
        "name": "Black Walnuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/black-walnuts.jpg",
        "desc": "Black walnuts are native to North America, particularly the eastern United States. They are medium-sized nuts, and a bit smaller than English walnuts. They have a thick, hard shell that can be challenging to crack.Black walnuts have a robust, rich, and earthy flavor. They are more intense and slightly bitter compared to the milder taste of English walnuts. Just like English walnuts, black walnuts are also used in baking, confectionery, and desserts. "
    },
    {
        "name": "Brazil Nuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/brazil-nuts.jpg",
        "desc": "Brazil nuts come from the Brazil nut tree (Bertholletia excelsa), which is native to the Amazon rainforest in South America, mainly Brazil, Peru, and Bolivia. Brazil nuts are large and have a round or oval shape. They are enclosed within a thick, hard shell and have a rich, creamy flavor with a slightly sweet and nutty taste.Brazil nuts are often eaten as a snack on their own or added to various recipes. They are commonly used in baking, confectionery, and desserts such as cookies, cakes, and fudge. Brazil nut oil, extracted from the nuts, is also used in cooking and as a nutritional supplement."
    },
    {
        "name": "Bunya Nut",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/bunya-nut.jpg",
        "desc": "Bunya nuts are native to Australia, particularly the eastern regions. Bunya nuts are relatively large, often weighing 15g (½ an ounce) or more, and have a flavor similar to starchy vegetables with a mildly sweet and nutty taste.Bunya nuts are commonly roasted or boiled before consuming. They can be used in savory dishes such as stir-fries, salads, and stews, or ground into flour for baking."
    },
    {
        "name": "Canarium Nut",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/canarium-nut.jpg",
        "desc": "Canarium nuts are native to various regions of Asia, including Indonesia, the Philippines, and Malaysia. They are relatively small, about the size of a large almond. Canarium nuts have a mild and slightly sweet flavor, resembling a combination of almond and cashew.Canarium nuts are commonly eaten roasted or used in confections, pastries, and desserts. They can also be used to make oils or incorporated into savory dishes like curries and stir-fries."
    },
    {
        "name": "Caramel Almond",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/caramel-almond.jpg",
        "desc": "There is no specific origin for caramel almonds as they are created by coating almonds with caramelized sugar or syrup. Perhaps it is a stretch to call this a different type of nut, but they are such a popular treat that we had to list them.They have a sweet and crunchy flavor due to the caramel coating, and are often eaten as a snack on their own. They can also be used as a topping for desserts like ice cream, cakes, or pastries, or added to salads or trail mixes for extra sweetness and texture. "
    },
    {
        "name": "Chestnuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/chestnuts.jpg",
        "desc": "Chestnuts are native to the northern hemisphere, particularly Europe, Asia, and North America. Chestnuts are larger compared to most other nuts, with a rounded shape and a size ranging from small to medium. They&#8217;ve made a resurgence in the USA after a blight wiped out most chestnut trees in the USA around 1900.Chestnuts have a mildly sweet and nutty flavor with a slightly starchy texture. They can be roasted, boiled, or steamed, and are commonly used in both sweet and savory dishes. Roasted chestnuts have long been a popular winter snack, thus the lyrics “chestnuts roasting on an open fire”. "
    },
    {
        "name": "Chinese Chestnut",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/chinese-chestnut.jpg",
        "desc": "Chinese chestnuts, as the name suggests, originate from China but are now grown in many other countries as well. They are medium-sized nuts, similar to other chestnut varieties, and have a sweet and nutty flavor. These trees are becoming popular in the USA among home gardeners as they grow well and produce plenty of nuts that conveniently fall from the tree when ripe.Chinese chestnuts are often roasted or boiled and consumed as a snack. They can also be used in stuffings, soups, desserts, or ground into flour for various culinary applications."
    },
    {
        "name": "English Walnut",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/english-walnuts.jpg",
        "desc": "The English walnut, also known as the common walnut or Persian walnut, originates from Central Asia, primarily Iran (Ancient Persia). English Walnuts are medium-sized nuts, typically around 1-2 inches in length. They have a mild, slightly sweet flavor with a buttery undertone.English walnuts are widely used in both sweet and savory dishes. They are commonly used in baking, such as in cakes, cookies, and pastries. They are also a popular addition to salads, cereals, and granola but can also be ground into a paste for savory uses. "
    },
    {
        "name": "Fritz Almonds",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/fritz-almonds.jpg",
        "desc": "Fritz almonds are a variety of almonds that originated in California (the largest producers of almonds worldwide). Fritz almonds are medium-sized almonds, similar in size to other common almond varieties. They have a sweet, nutty flavor that is characteristic of almonds in general. Fritz almonds are versatile, and can be used in a wide range of culinary creations. They are commonly used in baking, such as in cookies, cakes, and pastries. They can also be used in savory dishes, such as salads, stir-fries, or as a coating for meats or fish."
    },
    {
        "name": "Ginkgo Nuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/gingko-nuts.jpg",
        "desc": "Ginkgo nuts come from the ginkgo biloba tree, which is native to China. They have been used in traditional Chinese cuisine for centuries. Ginkgo nuts are small to medium-sized nuts, roughly the size of a cherry or grape, and have a unique, slightly sweet and nutty flavor.Ginkgo nuts are primarily used in Chinese cooking. They are commonly used in stir-fries, soups, and steamed dishes and can also be used in desserts, such as pastries and confections. However, it&#8217;s important to note that raw ginkgo nuts are toxic and must be properly cooked before consumption to remove certain substances that can cause adverse effects."
    },
    {
        "name": "Hazelnuts (See Filberts Above)",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2022/09/Hazelnuts.jpg",
        "desc": "Hazelnuts and Filberts are the same nut under a different name.&nbsp; While we are being redundant with this second listing, we think it important to note that Hazelnuts have a super-power which is being the key ingredient in Nutella. Want to make your own? Try this <a href=\"https://www.liveeatlearn.com/hazel-date-chocolate-spread/\">Vegan Copycat Nutella</a>. "
    },
    {
        "name": "Jack Nuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2022/07/how-to-cook-jackfruit-seeds-vert.jpg",
        "desc": "Jack Nuts are the seeds found within the jackfruit, a tropical fruit native to South Asia. As such, they aren’t technically nuts, but they are so similar to what we think of as nuts they had to be included. Jack Nuts are typically large, around 2 to 3 or more centimeters in length, and have a mild and nutty flavor similar to Brazil nuts. Jack Nuts are often roasted, boiled, or used in various culinary preparations. They can be used as a substitute for chestnuts and are commonly added to curries, stews, or ground into flour for baking. Their flavor is said to be similar to roasted chestnuts."
    },
    {
        "name": "Kurrajong Nuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/kurrajong-nuts.jpg",
        "desc": "Kurrajong nuts come from the kurrajong tree, which is native to Australia. Kurrajong nuts are small, typically around 1 to 2 centimeters in length, and have a mild, slightly sweet flavor.Kurrajong nuts can be eaten raw or roasted. They are often used in baking, added to cakes, bread, or used as a topping for desserts. Additionally, the seeds can be ground into flour for various culinary applications."
    },
    {
        "name": "Macadamia Nuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/macadamia-nuts.jpg",
        "desc": "Macadamia nuts are native to Australia, specifically Queensland and New South Wales. They are sometimes called Queensland nuts or bush nuts and are relatively large. Macadamia nuts have a rich, creamy, and buttery flavor. Macadamia nuts are often enjoyed as a snack or used in baking, such as in cookies, cakes, or as a topping for desserts. They can also be roasted and added to savory dishes or used to make nut butter. They are typically one of the more expensive varieties of nuts."
    },
    {
        "name": "Marcona Almond",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/marcona-almond.jpg",
        "desc": "Marcona almonds are native to Spain, and are typically small to medium in size and have a plump, oval shape. They have a delicate, sweet, and buttery flavor.Marcona almonds are highly regarded for their flavor and are often enjoyed as a snack on their own. They are also used in various culinary preparations, such as in desserts, pastries, or as a garnish for salads or main dishes."
    },
    {
        "name": "Mongongo Nuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/mangongo-nuts.jpg",
        "desc": "Mongongo nuts come from the mongongo tree, which is native to southern Africa. They are also known as manketti nuts or butter nuts. Mongongo nuts are small to medium-sized and have a hard, woody shell. Their flavor is a rather unique nutty taste.Mongongo nuts are traditionally used in African cuisine. They can be eaten raw, roasted, or ground into a paste. They are often used in stews, porridges, or as a snack. "
    },
    {
        "name": "Padre Almond",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/padre-almond.jpg",
        "desc": "The padre almond, also known as the orgeat almond, is an almond variety native to the Mediterranean region. Padre almonds are similar in size to other varieties of almonds. They typically measure around 1 to 1.5 centimeters in length, and have a mild, sweet flavor with a hint of bitterness.Padre almonds are commonly used in baking, confectionery, and as a topping for desserts. They are also used to produce almond milk, almond butter, and almond oil. In some Mediterranean cuisines, padre almonds are used in savory dishes like stews and salads."
    },
    {
        "name": "Paradise Nut",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/paradise-nut.jpg",
        "desc": "The paradise nut, also known as the sapucaia nut, is native to the Amazon rainforest in South America. Paradise nuts are large and can measure up to 10 cm (4 inches) in diameter. They are known for their creamy, nutty flavor with a texture similar to chestnuts.Paradise nuts are often roasted and eaten as a snack. They can also be used in desserts, confectionery, and baked goods. In some traditional Amazonian cuisines, the nuts are used in savory dishes such as stews or as a filling for empanadas."
    },
    {
        "name": "Pecans",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2022/10/pecan.jpg",
        "desc": "Pecans are native to North America, particularly the southern United States and Mexico. Pecans are medium-sized nuts, typically around 1 inch long, and have a rich, buttery flavor and a slightly sweet tastePecans are commonly used in baking, particularly in recipes like pecan pies, cookies, and cakes. They are also enjoyed as a snack on their own or used in savory dishes like salads and roasted vegetables. There are numerous types of pecans you can choose from to support your culinary aspirations. Our favorite use for Pecans is hands down this <a href=\"https://www.liveeatlearn.com/sweet-potato-casserole-with-pecan-crumble-meringue/\">Sweet Potato Casserole</a>. "
    },
    {
        "name": "Pignoli Nuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/pignoli-nuts.jpg",
        "desc": "Pignoli nuts are a variety of pine nuts harvested primarily from stone pines native to the&nbsp; Mediterranean region. Italy is particularly renowned for its production of pignoli nuts, where they are widely used in Italian cuisine.Pignoli nuts have a delicate, buttery flavor with a slightly sweet and resinous taste. They have a creamy textureoften described as mild and nutty with hints of pine."
    },
    {
        "name": "Pine Nuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/pine-nuts.jpg",
        "desc": "Pine nuts are the edible seeds of pine trees and are harvested from various pine species worldwide. They are also sometimes referred to as pignoli or pinon nuts.&nbsp; Pine nuts are small and elongated, typically measuring around 1/2 inch long, and have a delicate, buttery flavor with a slightly resinous and sweet taste.Pine nuts are commonly used in Mediterranean and Middle Eastern cuisines. They are a key ingredient in dishes like pesto, salads, pasta dishes, and baked goods. Pine nuts are also enjoyed as a <a href=\"https://www.liveeatlearn.com/roasted-goat-cheese-stuffed-dates/\">dessert topping</a>, and used in stuffing recipes. We think that <a href=\"https://www.liveeatlearn.com/pesto-genovese/\">Homemade Pesto</a> is, arguably, the best use of these little gems."
    },
    {
        "name": "Red Bopple Nut",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/red-bopple-nut.jpg",
        "desc": "The Red bopple nut, also known as red nut or ivory silky oak, is a relative of the macadamia nut, and is native to Australia. Red Bopple Nuts are typically round and about 1 cm in diameter, and have a rich, buttery flavor with a slightly sweet taste.Red Bopple Nuts are commonly used in both sweet and savory dishes. They can be eaten raw, roasted, or used in baking, desserts, salads, and as a topping for various dishes. They are also commonly processed into macadamia nut butter or oil."
    },
    {
        "name": "Saba Nuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/saba-nut.jpg",
        "desc": "Saba Nuts, also known as sapucaia nuts, come from the sapucaia tree, which is native to the Amazon rainforest in Brazil. Saba nuts are large and irregularly shaped, measuring about 3-4 cm in length. They have a creamy and slightly sweet flavor.Saba Nuts are commonly eaten roasted and salted as a snack. They can also be used in desserts, added to granola or muesli, or used as a topping for salads. In Brazil, the nuts are sometimes ground into a paste to make a traditional dessert called &#8220;doce de sapucaia.&#8221;"
    },
    {
        "name": "Tiger Nuts",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/tiger-nuts.jpg",
        "desc": "Tiger Nuts, also known as chufa nuts or earth almonds, are not actually nuts but rather small tubers or root vegetables. They have been cultivated in Egypt and other parts of North Africa for thousands of years. Tiger nuts are small, approximately 1-2 cm in length, and have a sweet and nutty flavor with a slight coconut-like taste.Tiger nuts are used in a variety of culinary ways. They can be eaten raw, roasted, or ground into flour. They are often used to make a traditional Spanish beverage called &#8220;horchata de chufa,&#8221; which is a sweet, milky drink. Tiger nut flour is also used in baking, particularly in gluten-free recipes, and they can be added to salads, smoothies, and desserts."
    },
    {
        "name": "Virginia Peanut",
        "image": "https://www.liveeatlearn.com/wp-content/uploads/2023/07/virginia-peanut.jpg",
        "desc": "Virginia peanuts originated in the Southeastern United States, and are sometimes called Virginia jumbo peanuts or ballpark peanuts. Virginia peanuts are typically the largest of all types of peanut, and are often considered the creamiest peanuts.Because of Virginia peanut’s large size and consistent color, they are mostly used as snacking peanuts. “Lesser” peanuts are generally relegated to making peanut butter, as that would be a waste of this ideal snacking peanut."
    }
]